src/DataProcessors/Scan_КалькуляторТарифовНаДоставку/Scan_КалькуляторТарифовНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Scan_КалькуляторТарифовНаДоставку</name>
</mdclass:DataProcessor>

src/InformationRegisters/Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий/Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТарифУказанВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>УслугаПакета</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛогистическийТип</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КолеснаяФормула</name>
    <type>
      <types>CatalogRef.Scan_КолесныеФормулыИзделий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки/Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОсновнаяУслуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_НоменклатураУслуг/Scan_НоменклатураУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_НоменклатураУслуг</name>
  <predefined>
    <items>
      <name>Доставка</name>
      <description>Доставка (перевозчик)</description>
    </items>
    <items>
      <name>ДоставкаЛьготная</name>
      <description>Доставка льготная</description>
    </items>
    <items>
      <name>ДоставкаЛьготнаяПоСкидке</name>
      <description>Доставка льготная расчет по скидке</description>
    </items>
    <items>
      <name>ДоставкаПолная</name>
      <description>Доставка полная</description>
    </items>
    <items>
      <name>УслугаПлатон</name>
      <description>Платон</description>
    </items>
    <items>
      <name>ПолисОСАГО</name>
      <description>Полис ОСАГО</description>
    </items>
    <items>
      <name>ПолучениеТранзитныхНомеров</name>
      <description>Получение транзитных номеров</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Catalogs/Scan_СтавкиНДС/Scan_СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтавкиНДС</name>
  <predefined>
    <items>
      <name>ОсновнаяСтавкаНДС</name>
      <description>18%</description>
    </items>
    <items>
      <name>ОсновнаяСтавкаНДССтарая</name>
      <description>20%</description>
    </items>
    <items>
      <name>БезНДС</name>
      <description>Без НДС</description>
    </items>
  </predefined>
  <attributes>
    <name>Ставка</name>
    <comment>Ставка налога на добавленную стоимость</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/Scan_КалькуляторТарифовНаДоставку/ManagerModule.bsl
//rarus tenkam 09.08.2017 mantis 10589 +++
Функция ПолучитьСтоимостьТарифаПоПакету(ПакетУслуг, ДатаДоставки, АдресПолучения, АдресДоставки, СпособДоставки, ЛогистическийТип, КолеснаяФормула) Экспорт
	СтоимостьДоставки = 0;
	
	АктуальныеУслуги = Новый ТаблицаЗначений;
	АктуальныеУслуги.Колонки.Добавить("Выбрать");
	АктуальныеУслуги.Колонки.Добавить("Услуга");
	АктуальныеУслуги.Колонки.Добавить("Стоимость");

	// Получим полную и льготные услуги
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.УслугаПакета КАК Услуга,
	|	Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних.Стоимость
	|ИЗ
	|	РегистрСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СрезПоследних(
	|			&ДатаДоставки,
	|			СпособДоставки = &СпособДоставки
	|				И АдресДоставки = &АдресДоставки
	|				И АдресПолучения = &АдресПолучения
	|				И КолеснаяФормула = &КолеснаяФормула
	|				И ЛогистическийТип = &ЛогистическийТип) КАК Scan_МатрицаТарифовДляДилеровПоДоставкеИзделийСрезПоследних";
	Запрос.УстановитьПараметр("АдресДоставки", АдресДоставки);
	Запрос.УстановитьПараметр("АдресПолучения", АдресПолучения);
	Запрос.УстановитьПараметр("ДатаДоставки", ДатаДоставки);
	Запрос.УстановитьПараметр("КолеснаяФормула", КолеснаяФормула);
	Запрос.УстановитьПараметр("ЛогистическийТип", ЛогистическийТип);
	Запрос.УстановитьПараметр("СпособДоставки", СпособДоставки);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяУслуга = АктуальныеУслуги.Добавить();
		НоваяУслуга.Услуга = ВыборкаДетальныеЗаписи.Услуга;
		НоваяУслуга.Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
		НоваяУслуга.Выбрать = Ложь;
	КонецЦикла;

	// Получим основную и доп. услуги	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.Услуга,
	|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.Стоимость,
	|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.ОсновнаяУслуга
	|ИЗ
	|	РегистрСведений.Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.СрезПоследних(
	|			&ДатаДоставки,
	|			Услуга <> ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.УслугаПлатон)) КАК Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних";	
	Запрос.УстановитьПараметр("ДатаДоставки", ДатаДоставки);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяУслуга = АктуальныеУслуги.Добавить();
		НоваяУслуга.Услуга = ВыборкаДетальныеЗаписи.Услуга;
		// rarus tenkam 24.12.2018 mantis 13896 +++    		
		//НоваяУслуга.Стоимость = ?(ВыборкаДетальныеЗаписи.ОсновнаяУслуга, ВыборкаДетальныеЗаписи.Стоимость * 1.18, ВыборкаДетальныеЗаписи.Стоимость);		
		НоваяУслуга.Стоимость = ?(ВыборкаДетальныеЗаписи.ОсновнаяУслуга, ВыборкаДетальныеЗаписи.Стоимость * (1 + Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС.Ставка / 100), ВыборкаДетальныеЗаписи.Стоимость);
		// rarus tenkam 24.12.2018 mantis 13896 ---
		НоваяУслуга.Выбрать = Ложь;	
	КонецЦикла;
	
	// Получим Платона
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.Услуга,
	|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.Стоимость
	|ИЗ
	|	РегистрСведений.Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.СрезПоследних(
	|			&ДатаДоставки,
	|			Услуга = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.УслугаПлатон)
	|				И СпособДоставки = &СпособДоставки
	|				И АдресПолучения = &АдресПолучения
	|				И АдресДоставки = &АдресДоставки) КАК Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних";	
	Запрос.УстановитьПараметр("ДатаДоставки", ДатаДоставки);
	Запрос.УстановитьПараметр("СпособДоставки", СпособДоставки);
	Запрос.УстановитьПараметр("АдресПолучения", АдресПолучения);
	Запрос.УстановитьПараметр("АдресДоставки", АдресДоставки);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НоваяУслуга = АктуальныеУслуги.Добавить();
		НоваяУслуга.Услуга = ВыборкаДетальныеЗаписи.Услуга;
		НоваяУслуга.Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
		НоваяУслуга.Выбрать = Ложь;
	КонецЕсли;
	
	// Получим ОСАГО
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.Услуга,
	|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.Стоимость
	|ИЗ
	|	РегистрСведений.Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.СрезПоследних(
	|			&ДатаДоставки,
	|			Услуга = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.ПолисОСАГО)
	|				И СпособДоставки = &СпособДоставки) КАК Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних";	
	Запрос.УстановитьПараметр("ДатаДоставки", ДатаДоставки);
	Запрос.УстановитьПараметр("СпособДоставки", СпособДоставки);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НоваяУслуга = АктуальныеУслуги.Добавить();
		НоваяУслуга.Услуга = ВыборкаДетальныеЗаписи.Услуга;
		НоваяУслуга.Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
		НоваяУслуга.Выбрать = Ложь;
	КонецЕсли;
	
	// Получим Получение транзитных номеров
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.Услуга,
	|	Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.Стоимость
	|ИЗ
	|	РегистрСведений.Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.СрезПоследних(
	|			&ДатаДоставки,
	|			Услуга = ЗНАЧЕНИЕ(Справочник.Scan_НоменклатураУслуг.ПолучениеТранзитныхНомеров)
	|				И СпособДоставки = &СпособДоставки) КАК Scan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних";	
	Запрос.УстановитьПараметр("ДатаДоставки", ДатаДоставки);
	Запрос.УстановитьПараметр("СпособДоставки", СпособДоставки);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НоваяУслуга = АктуальныеУслуги.Добавить();
		НоваяУслуга.Услуга = ВыборкаДетальныеЗаписи.Услуга;
		НоваяУслуга.Стоимость = ВыборкаДетальныеЗаписи.Стоимость;
		НоваяУслуга.Выбрать = Ложь;
	КонецЕсли;       	
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Услуга");
	Для Каждого ТекУслуга Из ПакетУслуг.СоставУслугПакета Цикл
		СтруктураПоиска.Услуга = ТекУслуга.Услуга;
		НайденныеСтроки = АктуальныеУслуги.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			НайденнаяУслуга = НайденныеСтроки[0];
			НайденнаяУслуга.Выбрать = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрокаУслуги Из АктуальныеУслуги Цикл
		Если ТекСтрокаУслуги.Выбрать Тогда
			СтоимостьДоставки = СтоимостьДоставки + ТекСтрокаУслуги.Стоимость;
		КонецЕсли;
	КонецЦикла;
	Возврат СтоимостьДоставки;

КонецФункции
//rarus tenkam 09.08.2017 mantis 10589 ---
